app/views/boards/index.html.erb

SELECT MAX("cards"."updated_at") FROM "cards" WHERE "cards"."board_id" = $1  [["board_id", 1]]
SELECT "cards".* FROM "cards" WHERE "cards"."board_id" = $1  [["board_id", 2]]
---
        <%= link_to board.title, board_path( board )%>
        <span class="badge badge-pill badge-primary"><%= board.cards.length %></span>