app/views/boards/show.html.erb

SELECT "cards".* FROM "cards" WHERE "cards"."board_id" = $1  [["board_id", 1]]
---
<div class="row">
  <% Card.valid_status.each do |status| %>

SELECT "cards".* FROM "cards" WHERE "cards"."board_id" = $1  [["board_id", 1]]
---
<div class="row">
  <% Card.valid_status.each do |status| %>

SELECT "cards".* FROM "cards" WHERE "cards"."board_id" = $1  [["board_id", 2]]
---

  <% @board.cards.select{|c| c.status == status}.each do |card| %>