app/controllers/boards_controller.rb

  def create
    @board = Board.new(board_params)

    respond_to do |format|
      if @board.save
---
INSERT INTO "boards" ("title", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["title", "Test"], ["created_at", "2023-12-20 19:53:54.502811"], ["updated_at", "2023-12-20 19:53:54.502811"]]

  def destroy
    @board.destroy
---
DELETE FROM "boards" WHERE "boards"."id" = $1  [["id", 1]]