app/controllers/cards_controller.rb

INSERT INTO "cards" ("title", "description", "status", "board_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Test"], ["description", "gwrthwzhwgfb dhgnwzjhnwrbg"], ["status", "todo"], ["board_id", 1], ["created_at", "2023-12-20 19:55:31.899729"], ["updated_at", "2023-12-20 19:55:31.899729"]]
---
  def create
    @card = @board.cards.build(card_params)
    respond_to do |format|
      if @card.save

UPDATE "cards" SET "status" = $1, "updated_at" = $2 WHERE "cards"."id" = $3  [["status", "backlog"], ["updated_at", "2023-12-20 19:55:33.768165"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @card.update(card_params)

SELECT "boards".* FROM "boards" WHERE "boards"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_board
    @board = Board.find(params[:board_id])

SELECT "cards".* FROM "cards" WHERE "cards"."board_id" = $1 AND "cards"."id" = $2 LIMIT $3  [["board_id", 1], ["id", 1], ["LIMIT", 1]]
---
  def set_card
    @card = @board.cards.find(params[:id])